Repository: vortexory/Majok-socialapp
Catalog: lib/l10n/app_*.arb
Languages: ar

# storyProposalTrip
source: You had been planning this dream vacation for years, a trip to the most beautiful and exotic place you had ever seen together. The scenery was breathtaking, with turquoise waters, lush green mountains, and vibrant, colorful flowers at every turn. You had been carrying the ring with you the entire time, tucked away safely in your luggage, waiting for the perfect, unforgettable moment. On your last day, at a scenic overlook with a view that seemed to stretch on forever, you knew this was it. With the stunning landscape as your witness, you told them that as beautiful as this place was, the most beautiful view you could ever imagine was spending the rest of your life with them.
ar: خلال إجازة أحلامكما، في أجمل مكان رأيتماه معًا. كان الخاتم يسافر في أمتعتك لأشهر، في انتظار اللحظة المثالية. مع وجود هذا المنظر الخلاب كشاهد، قلت لها إن أجمل منظر يمكن أن تتخيله هو قضاء بقية حياتك معها.

# storyProposalSurprise
source: It was a completely ordinary Tuesday evening. You were in your pajamas, debating what to watch on TV and what to have for dinner. There was no special occasion, no romantic getaway, no elaborate plan. But as you looked at them, laughing at one of your silly jokes, you were overcome with a powerful wave of love and certainty. You realized that you didn't want to wait for a 'perfect' moment, because every moment with them was perfect. You knew, with every fiber of your being, that you wanted to spend the rest of your life with this person. And so, in the middle of a perfectly normal, wonderfully mundane evening, you asked them to marry you, proving that when you know, you just know.
ar: كانت مفاجأة كاملة خلال مساء يوم ثلاثاء عادي. أدركت أنك عندما تعرف، فأنت تعرف، ولم تستطع الانتظار يومًا آخر. في منتصف أمسية عادية ورائعة، طلبت منها الزواج، لتثبت أن الحب لا يحتاج إلى توقيت مثالي.

# storyWeddingGarden
source: Your garden wedding was an enchanting and intimate affair, a magical celebration of your love held under the open sky. As the sun set, hundreds of twinkling fairy lights strung between the branches of ancient oak trees created a celestial canopy above you. The air was filled with the sweet, intoxicating scent of roses blooming in every corner, their vibrant colors a testament to the beauty of your love. The atmosphere was one of relaxed elegance and natural beauty, a perfect reflection of your relationship.
ar: كان حفل زفافكما في الحديقة ساحرًا وحميميًا، مع أضواء خيالية متدلية بين أشجار البلوط العتيقة والورود المتفتحة في كل زاوية، مما خلق جوًا من الأناقة الطبيعية التي عكست جمال علاقتكما.

# storyWeddingBeach
source: With the warm sand between your toes and the gentle ocean breeze carrying your whispered promises across the waves, you exchanged your vows in a breathtaking beach ceremony. The sound of the ocean was your wedding march, and the endless expanse of the sea was a symbol of the infinite possibilities that lay before you. The setting was simple yet profound, a reminder of the raw and natural beauty of your love. As the sun dipped below the horizon, casting a golden glow on the water, you sealed your union with a kiss, the waves applauding your love.
ar: تبادلتما عهود الزواج وأقدامكما على الرمال ونسيم المحيط يحمل وعودكما عبر الأمواج. كان مشهدًا بسيطًا وعميقًا، يذكركما بالجمال الخام والطبيعي لحبكما.

# storyWeddingCastle
source: It was a fairytale come to life, a magnificent castle wedding complete with grand, sweeping staircases, glittering crystal chandeliers, and opulent tapestries adorning the walls. You felt like royalty on your special day, your love story given the grand and majestic setting it deserved. The historic and romantic atmosphere of the castle added a timeless quality to your celebration, making it a day that you and your guests would never forget.
ar: حفل زفاف خيالي في قلعة، مع سلالم ضخمة وثريات متلألئة، مما جعلكما تشعران وكأنكما من الملوك في يومكما الخاص. الجو التاريخي للقلعة أضاف جودة خالدة لاحتفالكما.

# storyWeddingIntimate
source: You chose to celebrate your love with a small, intimate ceremony, surrounded by only your closest family and friends. The focus of the day was not on elaborate decorations or grand gestures, but on what truly mattered: the love that you shared. The atmosphere was one of warmth, sincerity, and heartfelt emotion, a true reflection of the deep and personal connection you had with each other and with your cherished guests.
ar: حفل صغير وحميمي مع أقرب أفراد عائلتكما وأصدقائكما فقط، مع التركيز على ما يهم حقًا - حبكما. كان الجو دافئًا وصادقًا، انعكاسًا حقيقيًا للرابط العميق بينكما.

# storyWeddingVineyard
source: Nestled amongst rolling hills and rows of lush grapevines, your vineyard wedding was a celebration of love, life, and the finer things. You celebrated your union with wine that was as rich, complex, and full-bodied as your relationship. The rustic yet elegant setting provided a stunning backdrop for your special day, the natural beauty of the vineyard a perfect complement to the love that was blossoming between you.
ar: بين التلال المتدحرجة وكروم العنب، احتفلتما بحبكما مع نبيذ غني ومعقد مثل علاقتكما. المشهد الريفي الأنيق وفر خلفية مذهلة ليومكما الخاص.

# storyWeddingMountain
source: High in the mountains, with majestic peaks surrounding you and an endless expanse of sky above, your love felt as boundless and awe-inspiring as the breathtaking view. You exchanged your vows in a ceremony that was both intimate and grand, the raw and untamed beauty of the mountains a powerful symbol of the strength and resilience of your love. The crisp mountain air and the sense of peace and tranquility made for a truly unforgettable and spiritual celebration.
ar: في أعالي الجبال، محاطين بالقمم والسماء اللامتناهية، شعر حبكما بأنه لا حدود له مثل المنظر الطبيعي. تبادلتما عهودكما في احتفال يجمع بين الحميمية والعظمة.

# storyWeddingCity
source: Your chic city wedding was a sophisticated and stylish affair, with breathtaking skyline views and a cool, urban elegance that perfectly reflected your modern love story. The sleek and contemporary venue, with its clean lines and minimalist décor, provided a stunning backdrop for your celebration. The energy of the city, with its vibrant pulse and endless possibilities, was a fitting tribute to your dynamic and forward-thinking relationship.
ar: حفل زفاف أنيق في المدينة مع إطلالات على الأفق وأناقة حضرية، يعكس قصة حبكما العصرية. المكان الحديث، بخطوطه النظيفة، كان تكريمًا لعلاقتكما الديناميكية.

# storyWeddingRustic
source: Your rustic barn wedding was a charming and romantic celebration, with the warm glow of string lights illuminating the weathered wood of the barn. Mason jar centerpieces filled with wildflowers adorned the tables, and the sweet, soulful melodies of a string quartet echoed through the countryside. The atmosphere was one of relaxed and unpretentious elegance, a perfect blend of country charm and timeless romance.
ar: حفل زفاف ريفي ساحر في حظيرة، مع قطع مركزية من برطمانات ماسون وموسيقى رباعي وتري يتردد صداها في الريف. كان الجو يجمع بين سحر الريف والرومانسية الخالدة.

# storyWeddingTropical
source: You escaped to a tropical paradise for your wedding, a celebration of love held under the shade of swaying palm trees with the gentle sound of waves providing your soundtrack. The vibrant colors of the tropical flowers, the warm, balmy air, and the laid-back, joyful atmosphere created a truly unforgettable and exotic experience for you and your guests. It was a wedding and a vacation all in one, a perfect start to your new life together.
ar: حفل زفاف في جنة استوائية، مع أشجار النخيل المتمايلة وصوت الأمواج الهادئة كموسيقى تصويرية لكما. الألوان النابضة بالحياة والجو المبهج خلقا تجربة لا تُنسى.

# storyWeddingWinter
source: Your winter wedding was a magical and enchanting affair, with a soft blanket of snow covering the ground and everything sparkling like diamonds in the moonlight. The cozy and intimate atmosphere was enhanced by the warm glow of candlelight and the crackling of a roaring fire. It was a truly romantic and fairytale-like celebration, the crisp winter air and the serene beauty of the snow-covered landscape creating a picture-perfect setting for your special day.
ar: حفل زفاف شتوي ساحر مع تساقط الثلج بلطف وكل شيء يتلألأ مثل الماس في ضوء القمر. الجو الدافئ والحميمي جعله احتفالًا رومانسيًا يشبه القصص الخيالية.

# storyWeddingModern
source: Your sleek, modern wedding was a reflection of your contemporary and forward-thinking love. The venue, with its clean lines, minimalist décor, and striking contemporary art, provided a sophisticated and stylish backdrop for your celebration. The focus was on clean design, innovative details, and a chic, understated elegance that perfectly captured your unique and modern approach to love and life.
ar: مكان أنيق وعصري بخطوط نظيفة وفن معاصر، يعكس تمامًا حبكما التقدمي. كان التركيز على التصميم النظيف والتفاصيل المبتكرة والأناقة البسيطة.

# storyWeddingClassic
source: Your timeless, classic wedding was a beautiful and elegant affair, with traditional elements that honored both of your families' heritage. The ceremony was filled with meaningful rituals and customs, and the reception was a grand celebration of your union. It was a day that was both deeply personal and universally understood, a testament to the enduring power of love and tradition.
ar: حفل زفاف كلاسيكي خالد مع عناصر تقليدية كرمت تراث عائلتيكما. كان يومًا شخصيًا للغاية ومفهومًا عالميًا، شهادة على قوة الحب والتقاليد الدائمة.

# storyWeddingBoho
source: Your bohemian celebration was a free-spirited and joyful affair, with flowing fabrics, an abundance of wildflowers, and a laid-back, relaxed atmosphere. You danced the night away under the stars, your hearts filled with the carefree and adventurous spirit that defined your relationship. It was a wedding that was as unique and unconventional as your love story, a true reflection of your creative and untamed hearts.
ar: احتفال بوهيمي مفعم بالبهجة، مع أقمشة انسيابية وزهور برية وروح حرة تملأ كل لحظة. كان حفل زفاف فريدًا وغير تقليدي مثل قصة حبكما.

# storyWeddingDestination
source: You whisked your guests away to an exotic and breathtaking destination for your wedding, turning your special day into an unforgettable adventure for everyone involved. The unique culture, stunning scenery, and shared experience of travel created a bond between you and your guests that would last a lifetime. It was a wedding that was more than just a single day; it was a journey, a story, and an experience that you would all cherish forever.
ar: حفل زفاف في وجهة غريبة، حول يومكما الخاص إلى مغامرة لا تُنسى لكما ولضيوفكما. التجربة المشتركة للسفر خلقت رابطًا يدوم مدى الحياة.

# storyWeddingBackyard
source: You transformed your own backyard into a magical wonderland for your wedding, proving that home truly is where the heart is. With personal touches and DIY details, you created a celebration that was both intimate and deeply meaningful. Surrounded by the familiar comforts of home and the love of your family and friends, you celebrated your union in a way that was uniquely and beautifully you.
ar: في حديقتكما الخلفية، التي تحولت إلى أرض عجائب، مما يثبت أن الوطن هو حقًا حيث يوجد القلب. بلمسات شخصية، خلقتما احتفالًا حميميًا وذا معنى عميق.

# babyLovesMusic
source: Gentle lullabies and classical melodies
ar: التهويدات اللطيفة والألحان الكلاسيكية

# babyLovesColors
source: Bright colors and rainbow toys
ar: الألوان الزاهية وألعاب قوس قزح

# babyLovesAnimals
source: Cute animals and stuffed friends
ar: الحيوانات اللطيفة والأصدقاء المحشوون

# babyLovesBooks
source: Story time and picture books
ar: وقت القصة وكتب الصور

# babyLovesNature
source: Flowers, trees, and outdoor adventures
ar: الزهور والأشجار ومغامرات الهواء الطلق

# babyLovesDancing
source: Wiggling and dancing to music
ar: الاهتزاز والرقص على الموسيقى

# babyLovesWater
source: Bath time splashing and swimming
ar: رش وقت الاستحمام والسباحة

# babyLovesCuddles
source: Warm hugs and snuggle time
ar: العناق الدافئ ووقت التدليل

# babyLovesStars
source: Twinkling stars and night lights
ar: النجوم المتلألئة وأضواء الليل

# babyLovesLaughter
source: Giggles and funny faces
ar: القهقهة والوجوه المضحكة

# babyLovesArt
source: Finger painting and creative mess
ar: الرسم بالأصابع والفوضى الإبداعية

# babyLovesFlowers
source: Pretty flowers and garden walks
ar: الزهور الجميلة ونزهات الحديقة

# babyLovesSinging
source: Nursery rhymes and silly songs
ar: أغاني الحضانة والأغاني السخيفة

# babyLovesAdventure
source: New places and exciting discoveries
ar: أماكن جديدة واكتشافات مثيرة

# babyLovesSweets
source: Gentle treats and fruity snacks
ar: الحلويات اللطيفة والوجبات الخفيفة المثمرة

# babyHatesLoudNoises
source: Sudden loud sounds and sirens
ar: الأصوات العالية المفاجئة والصفارات

# babyHatesDarkness
source: Dark rooms without night lights
ar: الغرف المظلمة بدون أضواء ليلية

# babyHatesBroccoli
source: Green vegetables at dinner time
ar: الخضروات الخضراء في وقت العشاء

# babyHatesWaiting
source: Having to wait for anything fun
ar: الاضطرار للانتظار لأي شيء ممتع

# babyHatesCrowds
source: Too many people at once
ar: الكثير من الناس في وقت واحد

# babyHatesBedtime
source: Going to sleep when it's play time
ar: الذهاب للنوم عندما يكون وقت اللعب

# babyHatesRain
source: Gloomy, wet days indoors
ar: الأيام الكئيبة والرطبة في الداخل

# babyHatesSpicy
source: Any food that's too spicy
ar: أي طعام حار جداً

# babyHatesMess
source: Sticky hands and dirty clothes
ar: الأيدي اللزجة والملابس القذرة

# babyHatesGoodbye
source: When loved ones have to leave
ar: عندما يضطر الأحباء للمغادرة

# babyHatesCold
source: Chilly weather and cold food
ar: الطقس البارد والطعام البارد

# babyHatesRush
source: Being hurried or rushed around
ar: الاستعجال أو التسرع

# babyHatesAngry
source: When people raise their voices
ar: عندما يرفع الناس أصواتهم

# babyHatesBoring
source: Sitting still for too long
ar: الجلوس ساكناً لفترة طويلة

# babyHatesEmpty
source: Empty plates and finished bottles
ar: الأطباق الفارغة والزجاجات المنتهية

# chatUserMsg1
source: Hey! How was your day? 😊
ar: مرحباً! كيف كان يومك؟ 😊

# chatUserMsg2
source: I just saw the most beautiful sunset!
ar: لقد رأيت أجمل غروب شمس!

# chatUserMsg3
source: What's your favorite type of music?
ar: ما نوع الموسيقى المفضل لديك؟

# chatUserMsg4
source: Do you believe in destiny?
ar: هل تؤمنين بالقدر؟

# chatUserMsg5
source: I love how you always make me smile
ar: أحب كيف تجعلينني أبتسم دائماً

# chatUserMsg6
source: What's your dream vacation spot?
ar: ما مكان عطلتك المثالية؟

# chatUserMsg7
source: You have such beautiful eyes
ar: لديك عيون جميلة جداً

# chatUserMsg8
source: I feel like I've known you forever
ar: أشعر وكأنني أعرفك منذ الأبد

# chatUserMsg9
source: What makes you happiest in life?
ar: ما الذي يجعلك أسعد في الحياة؟

# chatUserMsg10
source: I love our deep conversations
ar: أحب محادثاتنا العميقة

# chatUserMsg11
source: You're so easy to talk to
ar: من السهل جداً التحدث معك

# chatUserMsg12
source: What's your biggest dream?
ar: ما أكبر حلم لديك؟

# chatUserMsg13
source: I love how passionate you are
ar: أحب مدى شغفك

# chatUserMsg14
source: You make everything better
ar: تجعلين كل شيء أفضل

# chatUserMsg15
source: I can't stop thinking about you
ar: لا أستطيع التوقف عن التفكير فيك

# chatSoulmateMsg1
source: It was wonderful, especially now that I'm talking to you! ✨
ar: كان رائعاً، خاصة الآن وأنا أتحدث معك! ✨

# chatSoulmateMsg2
source: I bet it was nothing compared to your radiant smile 😍
ar: أراهن أنه لم يكن شيئاً مقارنة بابتسامتك المشرقة 😍

# chatSoulmateMsg3
source: I love anything that speaks to the soul... like you do 💕
ar: أحب أي شيء يتحدث للروح... مثلك 💕

# chatSoulmateMsg4
source: Absolutely! That's how I found you 🌟
ar: بالطبع! هكذا وجدتك 🌟

# chatSoulmateMsg5
source: Your happiness is my favorite sight in the world
ar: سعادتك هي المنظر المفضل لدي في العالم

# chatSoulmateMsg6
source: Anywhere with you would be paradise 🏝️
ar: أي مكان معك سيكون جنة 🏝️

# chatSoulmateMsg7
source: They're nothing compared to the beauty of your heart
ar: لا شيء مقارنة بجمال قلبك

# chatSoulmateMsg8
source: That's because we're meant to be together 💫
ar: لأننا مقدر لنا أن نكون معاً 💫

# chatSoulmateMsg9
source: You. You make me happiest 💖
ar: أنت. أنت تجعلينني الأسعد 💖

# chatSoulmateMsg10
source: Your mind is as beautiful as your soul
ar: عقلك جميل مثل روحك

# chatSoulmateMsg11
source: Because you understand me completely
ar: لأنك تفهمينني تماماً

# chatSoulmateMsg12
source: To spend every moment making you happy
ar: قضاء كل لحظة في إسعادك

# chatSoulmateMsg13
source: Your passion ignites my soul 🔥
ar: شغفك يشعل روحي 🔥

# chatSoulmateMsg14
source: You ARE everything to me
ar: أنت كل شيء بالنسبة لي

# chatSoulmateMsg15
source: I think about you with every heartbeat 💓
ar: أفكر فيك مع كل نبضة قلب 💓

# partnerTitleDreamWeaver
source: The Dream Weaver
ar: نساج الأحلام

# partnerTitleStarGazer
source: The Star Gazer
ar: محدق النجوم

# partnerTitleHeartWhisperer
source: The Heart Whisperer
ar: همس القلب

# partnerTitleSoulSeeker
source: The Soul Seeker
ar: باحث الروح

# partnerTitleLoveGuardian
source: The Love Guardian
ar: حارس الحب

# partnerTitleMoonDancer
source: The Moon Dancer
ar: راقص القمر

# partnerTitleSunChaser
source: The Sun Chaser
ar: مطارد الشمس

# partnerTitleWiseSage
source: The Wise Sage
ar: الحكيم

# partnerTitleGentleSpirit
source: The Gentle Spirit
ar: الروح اللطيفة

# partnerTitleKindHeart
source: The Kind Heart
ar: القلب الطيب

# partnerTitleBraveExplorer
source: The Brave Explorer
ar: المستكشف الشجاع

# partnerTitleCreativeMind
source: The Creative Mind
ar: العقل المبدع

# partnerTitlePeaceMaker
source: The Peace Maker
ar: صانع السلام

# partnerTitleJoyBringer
source: The Joy Bringer
ar: جالب البهجة

# partnerTitleLightBearer
source: The Light Bearer
ar: حامل النور

# shareSuccessMessage
source: Shared successfully! 💕
ar: تم المشاركة بنجاح! 💕

# shareErrorMessage
source: Failed to share. Please try again.
ar: فشل في المشاركة. الرجاء المحاولة مرة أخرى.

# shareImageButton
source: Share as Image
ar: مشاركة كصورة

# shareTextButton
source: Share Text
ar: مشاركة كنص

# profileInfoSection
source: Your Information
ar: معلوماتكمعلوماتك

# chapter1CompletedSummary
source: You've discovered your soulmate's traits!
ar: لقد اكتشفت صفات توأم روحك!

# chapter2CompletedSummary
source: Your love story has been written!
ar: تمت كتابة قصة حبك!

# chapter3CompletedSummary
source: You've met your future baby!
ar: لقد التقيت بطفلك المستقبلي!

# chapter4CompletedSummary
source: You've chatted with your soulmate!
ar: لقد تحدثت مع توأم روحك!

# chapter5CompletedSummary
source: You've found your perfect match!
ar: لقد وجدت مطابقتك المثالية!

# chapterCompletedDefault
source: You've unlocked this memory!
ar: لقد فتحت هذه الذكرى!

# chapter1UnlockedSummary
source: Discover your soulmate's traits
ar: اكتشف صفات توأم روحك

# chapter2UnlockedSummary
source: Create your unique love story
ar: اصنع قصة حبك الفريدة

# chapter3UnlockedSummary
source: Meet your future baby
ar: التق بطفلك المستقبلي

# chapter4UnlockedSummary
source: Chat with your soulmate
ar: تحدث مع توأم روحك

# chapter5UnlockedSummary
source: Find your perfect match
ar: اعثر على مطابقتك المثالية

# chapterUnlockedDefault
source: Ready to begin this chapter
ar: مستعد لبدء هذا الفصل

# dashboardSubtitle
source: Ready to discover your perfect match?
ar: مستعد لاكتشاف مطابقتك المثالية؟

# timeOfDayMorning
source: Good morning
ar: صباح الخير

# timeOfDayAfternoon
source: Good afternoon
ar: مساء الخير

# timeOfDayEvening
source: Good evening
ar: مساء الخير

# stationLockedMessage
source: Complete previous stations to unlock this one!
ar: أكمل المحطات السابقة لفتح هذه المحطة!

# stationStatusLocked
source: Locked
ar: مقفل

# stationStatusCompleted
source: Done
ar: تم

# generatingResultMessage
source: Generating your soulmate's traits...
ar: جاري إنشاء صفات توأم روحك...

# soulmateTraitsTitle
source: Your Soulmate's Traits
ar: صفات توأم روحك

# funnyQuirksTitle
source: Funny Quirks
ar: طرائف مضحكة

# seeYourStoryButton
source: See Your Story!
ar: شاهد قصتك!

# generatingStoryMessage
source: Writing your love story...
ar: جاري كتابة قصة حبك...

# generatingBabyMessage
source: Generating your baby profile...
ar: جاري إنشاء ملف طفلك الشخصي...

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Service
ar: شروط الاستخدام

# privacyPolicyTitle
source: Privacy Policy (Majok)
ar: سياسة الخصوصية (Majok)

# privacyPolicyLastUpdated
source: Last Updated: 01/08/2025
ar: تاريخ التحديث: 1 أغسطس 2025

# privacyPolicyIntro
source: Majok is a fun and satirical app designed for entertainment purposes only. We respect your privacy and aim to clarify the following:
ar: نحن نحترم خصوصيتك. تطبيق Majok هو تطبيق ترفيهي وساخر لا يجمع بيانات شخصية حساسة من المستخدمين. نوضح في هذه السياسة ما يلي:

# privacyPolicyWeDoNotCollect
source: We do NOT collect:
ar: لا نجمع:

# privacyPolicyWeDoNotCollectDesc
source: your real name, email, or any sensitive data.
ar: اسمك الحقيقي أو بريدك الإلكتروني أو أي بيانات حساسة.

# privacyPolicyUsageData
source: Usage Data:
ar: بيانات الاستخدام:

# privacyPolicyUsageDataDesc
source: Anonymous statistics may be collected via analytics tools.
ar: نستخدم أدوات تحليل لمراقبة استخدام التطبيق بشكل عام دون ربطه بهويتك.

# privacyPolicyAds
source: Ads:
ar: الإعلانات:

# privacyPolicyAdsDesc
source: The app may show ads that use cookies for personalization.
ar: قد نعرض إعلانات تستخدم ملفات تعريف الارتباط لغرض تخصيص المحتوى.

# privacyPolicyContent
source: Content:
ar: المحتوى:

# privacyPolicyContentDesc
source: All results are fictional and meant for humor only.
ar: جميع النتائج داخل التطبيق خيالية وساخرة فقط.

# privacyPolicyDataStorage
source: Data Storage:
ar: تخزين البيانات:

# privacyPolicyDataStorageDesc
source: No personal data is stored on servers.
ar: لا يتم تخزين بيانات شخصية على خوادمنا.

# privacyPolicyChanges
source: Policy Changes:
ar: تعديلات السياسة:

# privacyPolicyChangesDesc
source: Updates may occur with prior notice.
ar: قد نقوم بتحديث هذه السياسة في أي وقت مع إشعار مسبق إذا لزم الأمر.

# privacyPolicyContact
source: For inquiries, contact us at:
ar: للتواصل معنا:

# termsOfServiceTitle
source: Terms of Use (Majok)
ar: شروط الاستخدام (Majok)

# termsOfServiceIntro
source: By using Majok, you agree to the following:
ar: باستخدامك لتطبيق Majok، فإنك توافق على ما يلي:

# termsOfServiceEntertainment
source: The app is for entertainment only. Results are fictional.
ar: التطبيق لأغراض ترفيهية فقط. جميع النتائج خيالية.

# termsOfServiceAgeRequirement
source: You must be at least 13 years old to use this app.
ar: يجب أن يكون عمرك 13 سنة فأكثر لاستخدام هذا التطبيق.

# termsOfServiceFictionalContent
source: All names and traits are generated for humorous purposes only.
ar: جميع الأسماء والصفات عشوائية وتهدف للضحك فقط.

# termsOfServiceSharing
source: You may share your results but not modify them to harm others.
ar: يمكنك مشاركة النتائج بشرط عدم التعديل المسيء أو الاستخدام الضار.

# termsOfServiceAds
source: The app may include ads to support free access.
ar: قد يتم عرض إعلانات لدعم استمرار التطبيق مجانًا.

# termsOfServiceCopyright
source: All app content and design is copyrighted.
ar: جميع المحتوى والتصميمات محمية بحقوق النشر.

# termsOfServiceDisclaimer
source: We are not responsible for actions taken based on fictional content.
ar: نحن غير مسؤولين عن أي تصرفات مبنية على محتوى التطبيق الخيالي.

# termsOfServiceImportantNotice
source: Remember: All content in this app is purely fictional and created for entertainment. Please use responsibly and treat all results as jokes only.
ar: تذكر: جميع المحتوى في هذا التطبيق خيالي بحت وتم إنشاؤه للترفيه. يُرجى الاستخدام بمسؤولية واعتبار جميع النتائج مجرد نكات.

source: Soulmate
ar: توأم الروح

# station6Title
source: Restart Journey
ar: إعادة بدء الرحلة

# restartJourneyConfirmationTitle
source: Restart Journey?
ar: إعادة بدء الرحلة؟
