Repository: vortexory/Majok-socialapp
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcomeTopTitle
source: Future Spouse Finder
ar: مكتشف شريك المستقبل

# welcomeMainTitle
source: Welcome to Majok Spouse Generator!
ar: مرحباً بك في مولد ماجوك للشركاء!

# welcomeSubtitle
source: Tap to start your fun journey to discover your ideal partner!
ar: انقر لبدء رحلتك الممتعة لاكتشاف شريكك المثالي!

# welcomeStartButton
source: Tap to Start
ar: انقر للبدء

# onboardingAppBarTitle
source: Tell us about you!
ar: أخبرنا عنك!

# nameQuestion
source: What's your name?
ar: ما هو اسمك؟

# nameHint
source: Enter your first name
ar: أدخل اسمك الأول

# nextButton
source: Next
ar: التالي

# adPlaceholder
source: Advertisement
ar: إعلان

# ageQuestion
source: What's your age?
ar: كم عمرك؟

# heightQuestion
source: Enter your height. We'll find your perfect match based on all your unique traits!
ar: أدخل طولك. سنجد شريكك المثالي بناءً على كل صفاتك الفريدة!

# heightCardTitle
source: Your Height
ar: طولك

# heightUnitCm
source: cm
ar: سم

# heightUnitInches
source: inches
ar: بوصة

# adPlaceholderWithText
source: Advertisement: Discover Your Next Favorite App!
ar: إعلان: اكتشف تطبيقك المفضل التالي!

# weightQuestionTitle
source: How much do you weigh?
ar: كم يبلغ وزنك؟

# weightQuestionSubtitle
source: Be honest, it helps us find your perfect match!
ar: كن صريحاً، فهذا يساعدنا في العثور على شريكك المثالي!

# weightUnitKg
source: kg
ar: كجم

# weightUnitLbs
source: lbs
ar: رطل

# hobbiesQuestion
source: What makes your heart sing? Pick your favorite hobbies!
ar: ما الذي يبهج قلبك؟ اختر هواياتك المفضلة!

# hobbyMusic
source: Music
ar: الموسيقى

# hobbyReading
source: Reading
ar: القراءة

# hobbyGaming
source: Gaming
ar: الألعاب

# hobbyFitness
source: Fitness
ar: اللياقة

# hobbyArt
source: Art
ar: الفن

# hobbyCooking
source: Cooking
ar: الطبخ

# hobbyPhotography
source: Photography
ar: التصوير

# hobbyTravel
source: Travel
ar: السفر

# hobbyCoffee
source: Coffee
ar: القهوة

# hobbyVolunteering
source: Volunteering
ar: التطوع

# hobbyWriting
source: Writing
ar: الكتابة

# hobbyCrafts
source: Crafts
ar: الحرف اليدوية

# admobBannerPlaceholder
source: AdMob Banner Ad Placeholder
ar: مساحة إعلان بانر أدموب

# pathQuestionTitle
source: What's Your Path?
ar: ما هو مسارك؟

# pathQuestionSubtitle
source: Share a bit about your education or current job.
ar: شاركنا القليل عن تعليمك أو وظيفتك الحالية.

# pathCardTitle
source: Your Education & Job
ar: تعليمك و وظيفتك

# pathHint
source: e.g., Software Engineer, Aspiring Chef, Student
ar: مثال: مهندس برمجيات، طاهٍ طموح، طالب

# pathCharacterCounter
source: {count}/200 characters
ar: {count}/200 حرفاً

# genderQuestionTitle
source: Select Your Gender
ar: اختر جنسك

# genderMale
source: Male
ar: ذكر

# genderFemale
source: Female
ar: أنثى

# genderNonBinary
source: Non-binary
ar: غير ثنائي

# genderPreferNotToSay
source: Prefer Not to Say
ar: أفضل عدم القول

# resultAppBarTitle
source: Your Match!
ar: شريكك!

# resultLoves
source: Loves
ar: تحب

# resultHates
source: Hates
ar: تكره

# resultMatchChip
source: {percent}% Match!
ar: تطابق {percent}%!

# resultTryAgainButton
source: Try Again
ar: حاول مرة أخرى

# resultShareButton
source: Share Your Match!
ar: شارك نتيجتك!

# adResultPlaceholder
source: Advertisement: Discover Premium Match Insights!
ar: إعلان: اكتشف رؤى مميزة عن الشريك!

# hubTitle
source: Your Future Life
ar: حياتك المستقبلية

# hubProgress
source: {count} of 5 Stations Complete.
ar: تم إكمال {count} من 5 محطات.

# station1Title
source: Discover Partner's Traits
ar: اكتشف صفات الشريك

# station2Title
source: First Meeting & Wedding
ar: اللقاء الأول والزفاف

# station3Title
source: First Child Reveal
ar: الكشف عن الطفل الأول

# station4Title
source: Chat with Soulmate
ar: دردش مع توأم روحك

# station5Title
source: Soulmate Reveal
ar: الكشف عن توأم الروح

# navHome
source: Home
ar: الرئيسية

# navProgress
source: Progress
ar: التقدم

# navProfile
source: Profile
ar: الملف الشخصي

# profileTitle
source: My Profile
ar: ملفي الشخصي

# retryButton
source: Restart Journey
ar: أعد بدء الرحلة

# profileAge
source: Age
ar: العمر

# profileHeight
source: Height
ar: الطول

# profileGender
source: Gender
ar: الجنس

# profileHobbies
source: Hobbies
ar: الهوايات

# profileYears
source: years
ar: سنة

# navExplore
source: Explore
ar: اكتشف

# station1ScreenTitle
source: Destiny Seeker
ar: باحث القدر

source: Choose Your Destiny
ar: اختر قدرك

# destinyCard1Title
source: Mystic Sage
ar: الحكيم الغامض

# destinyCard1Desc
source: Grants profound wisdom
ar: يمنح حكمة عميقة

# destinyCard2Title
source: Swift Voyager
ar: الرحالة السريع

# destinyCard2Desc
source: Bestows unparalleled speed
ar: يهب سرعة لا مثيل لها

# destinyCard3Title
source: Iron Guardian
ar: الحارس الحديدي

# destinyCard3Desc
source: Confers unyielding strength
ar: يضفي قوة لا تلين

# learnMoreButton
source: Learn More
ar: اعرف المزيد

# puzzleTitle
source: Quick! Catch the Hearts!
ar: بسرعة! التقط القلوب!

# secondsLabel
source: SECONDS
ar: ثواني

# station1ResultTitle
source: Your Partner's Traits
ar: صفات شريكك

# traitHeight
source: Height
ar: الطول

# traitWeight
source: Weight
ar: الوزن

# traitEyeColor
source: Eye Color
ar: لون العيون

# traitHobbies
source: Hobbies
ar: الهوايات

# traitFunnyQuirks
source: Funny Quirks
ar: صفات مضحكة

# shareButton
source: Share Result
ar: شارك النتيجة

# station2AppBarTitle
source: Your Preferences
ar: تفضيلاتك

# zodiacQuestion
source: What is your Zodiac Sign?
ar: ما هو برجك الفلكي؟

# zodiacAries
source: Aries
ar: الحمل

# zodiacTaurus
source: Taurus
ar: الثور

# zodiacGemini
source: Gemini
ar: الجوزاء

# zodiacCancer
source: Cancer
ar: السرطان

# zodiacLeo
source: Leo
ar: الأسد

# zodiacVirgo
source: Virgo
ar: العذراء

# zodiacLibra
source: Libra
ar: الميزان

# zodiacScorpio
source: Scorpio
ar: العقرب

# zodiacSagittarius
source: Sagittarius
ar: القوس

# zodiacCapricorn
source: Capricorn
ar: الجدي

# zodiacAquarius
source: Aquarius
ar: الدلو

# zodiacPisces
source: Pisces
ar: الحوت

# nextStepButton
source: Next Step
ar: الخطوة التالية

# skipForNowButton
source: Skip for now
ar: تخط الآن

# station2HeroTitle
source: Let's personalize your journey!
ar: لنخصص رحلتك!

# station2HeroSubtitle
source: Tell us a bit about your favorite things to explore and dream about.
ar: أخبرنا قليلاً عن الأشياء المفضلة لديك لاستكشافها والحلم بها.

# destinationQuestion
source: Where's your dream destination?
ar: أين وجهة أحلامك؟

# destinationHint
source: Paris
ar: باريس

# spiritAnimalQuestion
source: Choose your spirit animal
ar: اختر حيوانك الروحي

# dreamRideQuestion
source: What's your dream ride?
ar: ما هي وسيلة أحلامك؟

# animalBrain
source: Cow
ar: بقرة

# animalCat
source: Cat
ar: قطة

# animalDog
source: Dog
ar: كلب

# animalGlobe
source: Globe
ar: كرة أرضية

# animalXMark
source: Bird
ar: طائر

# animalRabbit
source: Rabbit
ar: أرنب

# rideAirBalloon
source: Air Balloon
ar: منطاد الهواء

# rideRaceCar
source: Race Car
ar: سيارة سباق

# rideMotorcycle
source: Motorcycle
ar: دراجة نارية

# rideBicycle
source: Bicycle
ar: دراجة هوائية

# rideBus
source: Bus
ar: حافلة

# rideTruckVan
source: Truck Van
ar: شاحنة

# station2ResultTitle
source: Your Grand Romance
ar: رومانسيتك الكبرى

# storyHeadingMet
source: How You Met
ar: كيف التقيتما

# storyHeadingProposal
source: The Proposal
ar: عرض الزواج

# storyHeadingWedding
source: The Wedding
ar: الزفاف

# shareAsImageButton
source: Share Story
ar: شارك القصة

# station3AppBarTitle
source: Little Steps of Joy
ar: خطوات الفرح الصغيرة

# station3ChallengeTitle
source: Tap to Fill Baby's Bottle!
ar: انقر لملء زجاجة الطفل!

# station3ChallengeButton
source: Tap here
ar: اضغط هنا

# station3ProgressLabel
source: {percent}% Filled
ar: تم ملء {percent}%

# station3ResultTitle
source: Our Little Blessing
ar: بركتنا الصغيرة

# babyLoves
source: Loves:
ar: تحب:

# babyHates
source: Hates:
ar: تكره:

# babyLove1
source: Warm cuddles from Mama and Papa
ar: الأحضان الدافئة من ماما وبابا

# babyLove2
source: Chasing the family dog, "Sparky"
ar: مطاردة كلب العائلة، "سباركي"

# babyLove3
source: The sound of jingly toys
ar: صوت الألعاب الخشنة

# babyLove4
source: Morning sunshine on her face
ar: أشعة شمس الصباح على وجهها

# babyHate1
source: Cold wet wipes in the middle of the night
ar: المناديل المبللة الباردة في منتصف الليل

# babyHate2
source: When her pacifier falls out
ar: عندما يسقط مصاصها

# babyHate3
source: That little piece of broccoli Mama tries to sneak in
ar: تلك القطعة الصغيرة من البروكلي التي تحاول ماما دسها

# babyHate4
source: Being told to nap when she wants to play
ar: أن يُطلب منها القيلولة عندما تريد اللعب

# shareAnnouncementButton
source: Share Announcement
ar: شارك الإعلان

# station4AppBarTitle
source: Tell Us About You!
ar: أخبرنا عنك!

# celebScoopTitle
source: Celebrity Scoop!
ar: أخبار المشاهير!

# celebScoopSubtitle
source: Who lights up your world with their talent?
ar: من الذي يضيء عالمك بموهبته؟

# celebScoopHint
source: e.g., Zendaya, Ryan Gosling
ar: مثال: زيندايا، رايان غوسلينغ

# colorVibesTitle
source: Color Vibes!
ar: ذبذبات الألوان!

# colorVibesSubtitle
source: Pick your happiest hue. Tap to select!
ar: اختر أسعد لون لك. انقر للاختيار!

# fruityFavoritesTitle
source: Fruity Favorites!
ar: الفواكه المفضلة!

# fruityFavoritesSubtitle
source: Which one makes you smile the most?
ar: أي واحدة تجعلك تبتسم أكثر؟

# fruitApple
source: Apple
ar: تفاح

# fruitBanana
source: Banana
ar: موز

# fruitCitrus
source: Citrus
ar: حمضيات

# fruitGrape
source: Grape
ar: عنب

# fruitCherry
source: Cherry
ar: كرز

# fruitSunMoon
source: SunMoon
ar: شمس وقمر

# fruitPear
source: Pear
ar: كمثرى

# movieMagicTitle
source: Movie Magic!
ar: سحر الأفلام!

# movieMagicSubtitle
source: What film always makes your day better?
ar: ما الفيلم الذي يحسن يومك دائمًا؟

# movieMagicHint
source: e.g., Everything Everywhere All at Once
ar: مثال: كل شيء في كل مكان في آن واحد

# savePreferencesButton
source: Save My Preferences
ar: احفظ تفضيلاتي

# chatTitle
source: {name}, The {title}
ar: {name}، {title}

# chatPlaceholder
source: Say something sweet...
ar: قل شيئاً لطيفاً...

# typingIndicator
source: Typing...
ar: يكتب...

# finalLovesCoffee
source: Morning coffee rituals
ar: طقوس القهوة الصباحية

# finalLovesReading
source: Getting lost in good books
ar: الضياع في الكتب الجيدة

# finalLovesExploring
source: Exploring hidden cafés
ar: استكشاف المقاهي المخفية

# finalHatesFootball
source: Loud football matches
ar: مباريات كرة القدم الصاخبة

# finalHatesMornings
source: Being rushed in mornings
ar: الاستعجال في الصباح

# finalHatesNoises
source: Unnecessary loud noises
ar: الأصوات العالية غير الضرورية

# saveToGalleryButton
source: Save to Gallery
ar: احفظ في المعرض

# progressScreenTitle
source: Your Story So Far
ar: قصتك حتى الآن

# chapterLockedTitle
source: A new chapter awaits...
ar: فصل جديد في انتظارك...

# chapterLockedSubtitle
source: Complete the previous station to unlock this memory.
ar: أكمل المحطة السابقة لفتح هذه الذاكرة.

# chapterNextTitle
source: Next Chapter: {title}
ar: الفصل التالي: {title}

# chapterNextButton
source: Continue Your Story
ar: أكمل قصتك

# chapter1Title
source: The Spark: First Traits
ar: الشرارة: الصفات الأولى

# chapter2Title
source: The Romance: How You Met
ar: الرومانسية: كيف التقيتما

# chapter3Title
source: A Little Blessing Arrives
ar: وصول بركة صغيرة

# chapter4Title
source: The First Conversation
ar: المحادثة الأولى

# chapter5Title
source: The Soulmate Reveal
ar: الكشف عن توأم الروح

# finalRevealTitle
source: Your Perfect Match! 💕
ar: توافقك المثالي! 💕

# chatMsgUser1
source: Wow, that was quite the journey! Did my soulmate really turn out to be a mischievous garden gnome? 😂
ar: واو، يا لها من رحلة! هل حقاً تبين أن توأم روحي هو قزم حديقة مؤذٍ؟ 😂

# chatMsgSoulmate1
source: Haha, it seems so! But don't worry, your garden will be safe with me. 😉
ar: هاها، يبدو كذلك! لكن لا تقلق، ستكون حديقتك آمنة معي. 😉

# chatMsgUser2
source: Do you actually like gardening, or are you just here for the mischief?
ar: هل تحب البستنة حقًا، أم أنك هنا من أجل الأذى فقط؟

# chatMsgSoulmate2
source: Oh, I love gardening! Mischief is just my way of keeping things interesting.
ar: أوه، أنا أحب البستنة! الأذى هو طريقتي فقط لإبقاء الأمور ممتعة.

# chatMsgUser3
source: What's your favorite plant then?
ar: ما هو نباتك المفضل إذن؟

# chatMsgSoulmate3
source: Sunflowers! They're always looking on the bright side. 🌻 What about you?
ar: عباد الشمس! إنها تنظر دائمًا إلى الجانب المشرق. 🌻 ماذا عنك؟

# chatMsgUser4
source: I'm more of a cactus person... low maintenance, but full of surprises.
ar: أنا أميل إلى الصبار... قليل الصيانة، لكنه مليء بالمفاجآت.

# chatMsgSoulmate4
source: Haha, a cactus! Sharp, mysterious, and always resilient. I like that.
ar: هاها، صبار! حاد وغامض وصامد دائمًا. يعجبني ذلك.

# storyMetParagraph
source: In the gentle hush of the old university library, amidst towering shelves of forgotten tales, your eyes first met. It was a sun-drenched afternoon, the dust motes dancing in the golden light, and as you both reached for the same worn copy of 'Wuthering Heights,' a spark, as ancient as the stories around you, ignited. A shared smile, a whispered apology, and an hour later, you were lost not in the pages, but in each other's laughter over coffee, feeling as though fate had penned your introduction long ago.
ar: في هدوء المكتبة الجامعية القديمة، وسط أرفف شاهقة من الحكايات المنسية، التقت أعينكما لأول مرة. كانت ظهيرة مشمسة، وذرات الغبار ترقص في الضوء الذهبي، وعندما مددتما أيديكما معًا لنفس النسخة البالية من 'مرتفعات وذرينغ'، اشتعلت شرارة قديمة قدم القصص من حولكما. ابتسامة مشتركة، واعتذار هامس، وبعد ساعة، لم تكونا تائهين في الصفحات، بل في ضحكات بعضكما البعض على القهوة، وشعرتما وكأن القدر قد خط مقدمتكما منذ زمن بعيد.

# storyProposalParagraph
source: Years later, under a sky painted with twilight hues, beneath the very oak tree where you'd carved your initials on your first date, the air shimmered with anticipation. He knelt, not with grand gestures, but with quiet conviction, a velvet box held delicately in his trembling hand. His voice, soft as a lover's murmur, spoke of forever, of shared dreams and enduring love. As you whispered 'Yes,' the world seemed to hold its breath, sealing your promise under a canopy of nascent stars, a moment etched forever in the annals of your shared story.
ar: بعد سنوات، تحت سماء مزينة بألوان الشفق، أسفل شجرة البلوط ذاتها التي حفرتما عليها الأحرف الأولى من اسميكما في موعدكما الأول، تلألأ الهواء بالترقب. ركع، ليس بإيماءات عظيمة، بل بقناعة هادئة، وصندوق مخملي يُحمل برقة في يده المرتجفة. صوته، ناعم كهمس عاشق، تحدث عن الأبدية، وعن الأحلام المشتركة والحب الدائم. عندما همست بـ 'نعم'، بدا العالم وكأنه يحبس أنفاسه، مختومًا بوعدك تحت مظلة من النجوم الوليدة، لحظة محفورة إلى الأبد في سجلات قصتكما المشتركة.

# storyWeddingParagraph
source: The day dawned, clear and bright, a tapestry woven with joy and anticipation. Amidst blooming roses and the joyful chorus of loved ones, you walked towards each other, vows exchanged like sacred verses. Every glance, every touch, spoke volumes of a love refined by time and deepened by affection. The celebration that followed was a joyous symphony of laughter, dancing, and heartfelt toasts, marking the beginning of your grandest chapter. As you shared your first dance, wrapped in an embrace that felt like coming home, you knew this was just the prologue to your beautiful, unending story.
ar: بزغ فجر اليوم، صافيًا ومشرقًا، نسيجًا منسوجًا بالفرح والترقب. وسط الورود المتفتحة وجوقة الأحباء المبهجة، سرتما نحو بعضكما البعض، وتبادلتما العهود كآيات مقدسة. كل نظرة، كل لمسة، تحدثت عن حب صقله الزمن وعمقته المودة. كان الاحتفال الذي تلا ذلك سيمفونية مبهجة من الضحك والرقص والأنخاب القلبية، إيذانًا ببداية أروع فصولكما. عندما تشاركتما رقصتكما الأولى، محاطين بعناق شعرتما فيه وكأنكما عدتما إلى الوطن، علمتما أن هذا كان مجرد مقدمة لقصتكما الجميلة التي لا تنتهي.

# station5PuzzleTitle
source: Trace Your Destiny
ar: ارسم قدرك

# station5PuzzleHint
source: Touch the bright star and drag to the glowing one
ar: المس النجم المضيء واسحب إلى النجم المتوهج

# homeButton
source: Go to Home
ar: اذهب للرئيسية

# eyeColorBrown
source: Brown
ar: بني

# eyeColorBlue
source: Blue
ar: أزرق

# eyeColorGreen
source: Green
ar: أخضر

# eyeColorHazel
source: Hazel
ar: عسلي

# eyeColorGray
source: Gray
ar: رمادي

# eyeColorAmber
source: Amber
ar: كهرماني

# eyeColorBlack
source: Black
ar: أسود

# eyeColorDarkBrown
source: Dark Brown
ar: بني داكن

# eyeColorLightBlue
source: Light Blue
ar: أزرق فاتح

# eyeColorDeepGreen
source: Deep Green
ar: أخضر عميق

# eyeColorGolden
source: Golden
ar: ذهبي

# eyeColorViolet
source: Violet
ar: بنفسجي

# eyeColorTurquoise
source: Turquoise
ar: تركوازي

# eyeColorEmerald
source: Emerald
ar: زمردي

# eyeColorChestnut
source: Chestnut
ar: كستنائي

# hobbiesGamingArt
source: Gaming & Art
ar: الألعاب والفن

# hobbiesReadingMusic
source: Reading & Music
ar: القراءة والموسيقى

# hobbiesCookingTravel
source: Cooking & Travel
ar: الطبخ والسفر

# hobbiesFitnessPhotography
source: Fitness & Photography
ar: اللياقة والتصوير

# hobbiesWritingCoffee
source: Writing & Coffee
ar: الكتابة والقهوة

# hobbiesDancingMovies
source: Dancing & Movies
ar: الرقص والأفلام

# hobbiesGardeningBooks
source: Gardening & Books
ar: البستنة والكتب

# hobbiesPaintingHiking
source: Painting & Hiking
ar: الرسم والمشي

# hobbiesYogaMeditation
source: Yoga & Meditation
ar: اليوغا والتأمل

# hobbiesSingingGuitar
source: Singing & Guitar
ar: الغناء والغيتار

# hobbiesRunningSwimming
source: Running & Swimming
ar: الجري والسباحة

# hobbiesBakingCrafts
source: Baking & Crafts
ar: الخبز والحرف

# hobbiesVolunteeringPets
source: Volunteering & Pets
ar: التطوع والحيوانات

# hobbiesLanguagesTravel
source: Languages & Travel
ar: اللغات والسفر

# hobbiesTechInnovation
source: Tech & Innovation
ar: التكنولوجيا والابتكار

# quirkHatesKetchup
source: Hates putting ketchup on burgers
ar: يكره وضع الكاتشب على البرغر

# quirkKnowsPokemon
source: Can name every single Pokémon
ar: يستطيع تسمية كل بوكيمون

# quirkSingsInCar
source: Sings loudly, but only in the car
ar: يغني بصوت عالٍ، لكن في السيارة فقط

# quirkCollectsRocks
source: Collects interesting rocks from every trip
ar: يجمع الأحجار الجميلة من كل رحلة

# quirkTalksToPlants
source: Talks to plants to help them grow
ar: يتحدث مع النباتات لمساعدتها على النمو

# quirkDancesWhileCooking
source: Always dances while cooking
ar: يرقص دائماً أثناء الطبخ

# quirkCountsSteps
source: Counts steps when walking upstairs
ar: يعد الدرجات عند صعود السلم

# quirkNamesDevices
source: Names all electronic devices
ar: يسمي جميع الأجهزة الإلكترونية

# quirkMemorizesLyrics
source: Memorizes song lyrics after hearing once
ar: يحفظ كلمات الأغاني بعد سماعها مرة واحدة

# quirkOrganizesByColor
source: Organizes everything by color
ar: ينظم كل شيء حسب اللون

# quirkMakesWeirdFaces
source: Makes weird faces when concentrating
ar: يصنع وجوهاً غريبة عند التركيز

# quirkHumsUnconsciously
source: Hums unconsciously when happy
ar: يدندن دون وعي عندما يكون سعيداً

# quirkPerfectionist
source: Perfectionist with morning coffee routine
ar: مثالي في روتين القهوة الصباحية

# quirkNightOwl
source: Night owl who's most creative at 2 AM
ar: بومة ليلية أكثر إبداعاً في الثانية صباحاً

# quirkLaughsAtOwnJokes
source: Laughs at own jokes before telling them
ar: يضحك على نكاته قبل قولها

source: How We Met
ar: كيف التقينا

source: The Proposal
ar: عرض الزواج

source: The Wedding
ar: الزفاف

# storyMetCoffeeShop
source: The scent of roasted coffee beans and freshly baked pastries hung thick in the air of the bustling coffee shop. You had both been eyeing the last, plump blueberry muffin, a perfect golden dome studded with juicy berries. As you both reached for it, your hands brushed, sending a small spark through the air. Instead of an awkward retreat or a polite concession, a shared smile bloomed between you. A silent agreement was made, and you decided to split the muffin. That simple act of sharing led to a conversation that flowed as smoothly as the lattes you both ordered. You talked about everything and nothing, from favorite books to dreams for the future, the noisy chatter of the café fading into a soft hum. The hours melted away, and it was only when the barista regretfully announced closing time that you realized you had been talking for the better part of the day, the two halves of a muffin having led to the discovery of your other half.
ar: تقابلتما في مقهى مزدحم، تفوح منه رائحة حبوب البن المحمصة والمعجنات الطازجة. كلاكما كان يمد يده لآخر قطعة من مافن التوت الأزرق. وبدلاً من الشجار عليها، قررتما مشاركتها على طاولة حوار استمر حتى موعد الإغلاق، حيث أدت مشاركة قطعة المافن إلى اكتشاف كل منكما لنصفه الآخر.

# storyMetBookstore
source: In the quiet, hallowed aisles of a cozy, independent bookstore, surrounded by the comforting scent of old paper and ink, your eyes met over the philosophy section. It was a haven for dreamers and thinkers, and you were both reaching for the same worn, rare edition of a book about love and destiny, its title seeming to hold a special significance in that moment. It felt like a scene from a movie, a serendipitous alignment of hands and hearts. You both chuckled, a little embarrassed but undeniably intrigued. A conversation sparked, whispered at first so as not to disturb the other patrons, but soon you were lost in a world of your own, discussing the book's profound ideas about connection and fate. You moved from the philosophy aisle to the poetry section, sharing your favorite verses, and then to the cozy armchairs by the window, dissecting the very meaning of the words you had both so eagerly sought, realizing that the story you were most interested in was the one that was just beginning to unfold between you.
ar: تقابلت أعينكما عبر قسم الفلسفة في مكتبة هادئة ومريحة، تفوح منها رائحة الورق القديم. كنتما تصلان إلى نفس الكتاب النادر عن الحب والقدر. أمضيتما ساعات تناقشان معانيه، مدركين أن القصة الأجمل كانت تلك التي بدأت تتكشف بينكما.

# storyMetPark
source: The early morning air was crisp and cool, the rising sun casting a golden glow over the dew-kissed grass of the park. You were in the zone, lost in the rhythm of your morning jog, when you saw them struggling, a frustrated tangle of headphone wires creating a comical yet relatable ordeal. You slowed your pace and offered to help, your fingers brushing as you carefully worked to unscramble the mess. The simple act of kindness led to a shared laugh, and the jog was momentarily forgotten. You found yourselves on a park bench, the newly untangled headphones now silent as you talked. The conversation flowed effortlessly, moving from your favorite running paths to your deepest aspirations as the sun climbed higher in the sky, its warmth mirroring the growing connection between you. What started as a tangled mess had unraveled into a beautiful and unexpected beginning.
ar: لقاء صدفة أثناء الركض الصباحي في الحديقة. توقفت لمساعدته في فك تشابك أسلاك سماعاته، وانتهى بكما الأمر تتحدثان على مقعد بينما تشرق الشمس، حيث تحول التشابك إلى بداية جميلة وغير متوقعة.
