Repository: vortexory/Majok-socialapp
Catalog: lib/l10n/app_*.arb
Languages: ar

# storyMetLibrary
source: The hushed quiet of the library had become a familiar comfort, a shared space where you both sought refuge and knowledge. For weeks, you had noticed each other, seated at the same large oak table, a silent understanding passing between you in the form of shy, fleeting glances. You knew their favorite reading spot, the way they would unconsciously chew on their pen when deep in thought, and the titles of the books that piled up beside them. The unspoken connection grew stronger with each passing day, a silent story being written in the margins of your study sessions. Finally, mustering all your courage, you decided to break the silence not with words, but with a note. You carefully tucked it into the pages of their favorite book, a classic novel you had seen them reread multiple times. The note was simple, just a few words, but it held the promise of a new chapter, one that would hopefully be read together.
ar: كنتما تريان بعضكما البعض باستمرار على نفس الطاولة في المكتبة. بعد أسابيع من النظرات الخجولة، تركت له أخيرًا ملاحظة في كتابه المفضل، ملاحظة بسيطة تحمل وعدًا بفصل جديد يُقرأ معًا.

# storyMetGym
source: The clanking of weights and the rhythmic hum of treadmills was the soundtrack to your budding connection. You were unofficial gym buddies, your workout schedules aligning so perfectly it seemed almost intentional. You would exchange nods of encouragement, share a knowing smile after a particularly grueling set, and even save machines for each other. The easy camaraderie was there, a comfortable foundation built on shared dedication and mutual respect. But beneath the surface of friendly competition and synchronized sweat sessions, a different kind of energy was building. One day, after a particularly intense workout, fueled by a surge of adrenaline and a 'now or never' feeling, you finally broke the routine. Instead of the usual fist bump and parting ways, you asked them on a smoothie date. The surprised but happy 'yes' was more rewarding than any personal best you had ever achieved.
ar: كنتما رفيقين في النادي الرياضي وبدا أن جدول تمارينكما متطابق دائمًا. في أحد الأيام، استجمعت شجاعتك أخيرًا وطلبت منه الخروج لتناول عصير بعد التمرين، وكانت إجابته بـ 'نعم' أكثر إنجاز حققته.

# storyMetAirport
source: The sterile, impersonal atmosphere of the airport terminal was transformed by an unexpected twist of fate: a significantly delayed flight. What began as a shared sigh of frustration over the lack of charging ports quickly blossomed into something more. You offered to share your power bank, a small gesture of kindness in a sea of weary travelers. That simple act opened the door to a conversation that spanned continents and life experiences. With nothing but time on your hands, you shared stories of your travels, your families, your dreams, and your fears. The eight-hour delay, which could have been a tedious ordeal, became an intimate and unforgettable journey into each other's worlds. By the time the final boarding call was announced, you knew you had found a travel companion for life, someone with whom you wouldn't mind being stranded anywhere.
ar: رحلة طيران متأخرة جمعتكما معًا. ما بدأ بمشاركة منافذ الشحن تحول إلى مشاركة قصص الحياة خلال تأخير دام 8 ساعات، مما حول تجربة مرهقة إلى رحلة لا تُنسى في عوالم بعضكما البعض.

# storyMetConcert
source: The energy in the concert hall was electric, a palpable buzz of anticipation for your favorite artist to take the stage. You found yourselves standing next to each other in the crowd, both singing along with an infectious enthusiasm. But it was when the artist launched into a deep cut, a rare and beloved B-side track that only the most dedicated fans would know, that something truly special happened. You both turned to each other, eyes wide with surprise and delight, as you sang every single word in perfect harmony. In that moment, amidst the roar of the crowd and the flashing lights, you felt an instant and profound connection. It was more than just shared musical taste; it was a shared passion, a shared understanding, a feeling of being truly seen and understood. The rest of the concert was a blur of dancing, singing, and stolen glances, the music providing the perfect soundtrack to the beginning of your love story.
ar: كنتما في حفل لفنانكما المفضل. عندما عرف كل منكما كلمات الأغاني النادرة، أدركت أنك وجدت شخصًا مميزًا. في تلك اللحظة، شعرت باتصال فوري وعميق، اتصال يتجاوز مجرد الذوق الموسيقي المشترك.

# storyMetBeach
source: The sun was high and the sand was warm, the perfect day for a spirited game of beach volleyball. You were on opposite teams, the net a playful barrier between you. The competitive spirit was fierce, with every spike and dive met with good-natured taunts and triumphant cheers. But as the game progressed, the competitive fire slowly transformed into a playful flirtation. A well-aimed shot would be followed by a wink, a missed serve met with a charmingly apologetic smile. By the time the sun began to dip below the horizon, painting the sky in fiery hues of orange and pink, the game was long forgotten. You sat together on the cooling sand, the volleyball resting between you, and talked until the first stars appeared, the playful rivalry having given way to a sweet and undeniable attraction.
ar: لعبة كرة طائرة شاطئية حيث كنتما في فريقين متنافسين. الروح التنافسية تحولت إلى مغازلة مرحة مع غروب الشمس، وانتهت اللعبة لتبدأ محادثة على الرمال الدافئة استمرت حتى ظهور النجوم الأولى.

# storyMetMuseum
source: The art exhibition was a showcase of avant-garde and abstract pieces, and as you wandered through the quiet, white-walled galleries, you couldn't help but notice that you were both the only people under the age of thirty in attendance. A shared, amused glance across a particularly bewildering sculpture was all it took to break the ice. You started whispering to each other, your initial, serious critiques quickly devolving into making up wild and hilarious backstories for the portraits and paintings. The stern-faced nobleman in the oil painting became a time-traveling rock star, and the abstract splash of colors was a depiction of a chaotic toddler's birthday party. You spent the entire afternoon lost in your own world of creativity and laughter, finding more art in your shared humor than in any of the pieces on display.
ar: كنتما الشخصين الوحيدين تحت سن الثلاثين في معرض فني. أمضيتما فترة ما بعد الظهيرة بأكملها في اختلاق قصص مضحكة عن اللوحات، ووجدتما فنًا في حس الدعابة المشترك بينكما أكثر من أي قطعة معروضة.

# storyMetSupermarket
source: The fluorescent lights of the supermarket aisle cast a mundane glow on your evening grocery run. You saw them staring up at the top shelf, a look of mild frustration on their face as they tried to reach a jar of artisanal honey. Being a little taller, you offered to help, your hand brushing theirs as you passed them the jar. A simple act of kindness in a commonplace setting. But what started as a brief exchange about the merits of different types of honey turned into a full-blown conversation that wound its way through the produce section, the bakery, and the international foods aisle. You discovered a shared love for cooking and experimenting with new recipes. By the time you reached the checkout, the impromptu grocery run had turned into a spontaneous plan for a cooking date that very same evening, proving that romance can be found in the most unexpected of places.
ar: ساعدته في الوصول إلى شيء على الرف العلوي. تحولت جولة تسوق البقالة إلى موعد للطهي في نفس المساء، مما يثبت أن الرومانسية يمكن العثور عليها في أكثر الأماكن غير المتوقعة.

# storyMetRain
source: An unexpected downpour had sent people scurrying for cover, but you were prepared, your trusty umbrella held high. You saw them huddled under a small awning, looking out at the rain with a resigned sigh. Without a second thought, you walked over and offered to share your umbrella. They accepted with a grateful smile, and you both set off, walking side-by-side under the protective canopy. You walked slowly, deliberately, not wanting the shared moment to end. The sound of the rain drumming on the umbrella created an intimate cocoon, shutting out the rest of the world. By the time the rain had softened to a drizzle and then stopped altogether, you were miles from where you had started. But you didn't mind. You kept walking, the now-unnecessary umbrella still held between you, a silent testament to the storm that had brought you together.
ar: عرضت أن تشاركه مظلتك أثناء هطول أمطار غزيرة غير متوقعة. مشيتما ببطء شديد حتى توقف المطر، لكنكما واصلتما المشي، والمظلة التي لم تعد ضرورية أصبحت شاهدًا صامتًا على العاصفة التي جمعتكما.

# storyMetElevator
source: The gentle hum of the elevator came to an abrupt halt, followed by a sudden jolt and then an unnerving silence. You were stuck. Trapped between floors with a complete stranger. The first few minutes were filled with an awkward silence, punctuated only by the occasional nervous cough. But as the minutes stretched into an hour, and then two, the initial awkwardness melted away. With nothing else to do, you started talking. You shared stories, dreams, and vulnerabilities that you had never confessed to anyone before. In the close confines of that metal box, you found a surprising and profound connection. What started as a frightening and inconvenient situation became the most meaningful and transformative conversation of your lives. When the elevator doors finally creaked open, you stepped out not as strangers, but as two people whose lives had been irrevocably changed by a chance encounter.
ar: علق المصعد بكما لمدة ساعتين. ما بدأ كصمت محرج تحول إلى أكثر محادثة ذات معنى في حياتكما. في هذا الصندوق المعدني الضيق، وجدتما اتصالاً عميقًا ومدهشًا غيّر حياتكما إلى الأبد.

# storyMetDogPark
source: Your dogs were the ones who made the first move. A boisterous Golden Retriever and a playful French Bulldog, they became inseparable from the moment they met at the dog park, their joyful antics a daily source of amusement. You, their respective owners, were initially just casual acquaintances, making small talk while your furry companions wrestled and chased each other. But as the daily play dates continued, you found yourselves looking forward to your conversations as much as your dogs looked forward to their playtime. You graduated from discussing dog breeds and training tips to sharing stories about your lives, your work, and your dreams. You had no choice but to follow your dogs' lead and become best friends, and eventually, something more.
ar: أصبحت كلابكما أفضل الأصدقاء أولاً. لم يكن لديكما خيار سوى أن تحذوا حذوهما خلال مواعيد اللعب اليومية، حيث تحولت الأحاديث الصغيرة عن الكلاب إلى مشاركة قصص حياتكما وأحلامكما.

# storyMetWorkshop
source: The pottery class was meant to be a fun, creative outlet, a chance to get your hands dirty and make something beautiful. You were paired up as partners, your initial attempts at the pottery wheel resulting in a lopsided, wobbly mess that had you both laughing until your sides hurt. But as you worked together, your hands guiding the clay, you found a rhythm, a synergy that went beyond the pottery wheel. Your first creation together was a wonky, imperfect vase, but you cherished it more than any masterpiece. It became a symbol of your burgeoning relationship, a tangible reminder of the day you molded something beautiful together, both out of clay and out of a chance encounter.
ar: كنتما شريكين في فصل لصناعة الفخار. كانت أول قطعة صنعتماها معًا مزهرية ملتوية، لكنها أصبحت أثمن ممتلكاتكما، رمزًا ملموسًا لليوم الذي شكلتما فيه شيئًا جميلًا معًا، من الطين ومن لقاء صدفة.

# storyMetVolunteering
source: You both felt a calling to give back to your community, a shared desire to make a difference. You met while volunteering at a local animal shelter, your days filled with the rewarding work of caring for abandoned and neglected animals. Working side-by-side, cleaning cages, walking dogs, and comforting scared kittens, you saw the best in each other. You saw their kindness, their patience, their compassion, and their unwavering dedication. It was in those quiet moments of shared purpose, of working together to help those in need, that you realized you had found someone whose heart was as big as your own. Your shared love for animals was just the beginning of a much deeper and more meaningful connection.
ar: التقيتما أثناء التطوع في مأوى محلي للحيوانات. العمل معًا لمساعدة الآخرين أظهر لكما طبيعة بعضكما البعض، حيث رأيت لطفه وصبره وتفانيه. حبكما المشترك للحيوانات كان مجرد بداية لاتصال أعمق بكثير.

# storyProposalSunset
source: The air grew cooler as you made your way up your favorite hill, the one that overlooked the entire city. It was a place you had come to so many times before, a place of quiet reflection and shared dreams. As the sun began its descent, painting the sky in fiery strokes of orange, pink, and gold, the city lights below began to twinkle to life, like a thousand tiny diamonds scattered across a velvet cloth. In that magical moment, suspended between the fading day and the emerging night, you turned to them, your heart pounding in your chest. With the last ray of sunlight kissing the horizon, you got down on one knee, the world seeming to hold its breath as you asked them to be yours forever.
ar: أثناء غروب ذهبي على تلتكما المفضلة، مع بدء أضواء المدينة في التلألؤ في الأسفل، ركعت على ركبة واحدة بينما قبل آخر شعاع من ضوء الشمس الأفق، وسألت السؤال الأهم في تلك اللحظة السحرية.

# storyProposalMountain
source: The air was thin and crisp at the summit of the mountain, the culmination of a challenging but rewarding climb that mirrored your journey together. It was the same mountain you had conquered on your first adventure, a place that held a special significance in your hearts. As you stood there, hand in hand, catching your breath and taking in the breathtaking panoramic view, you knew this was the moment. You reached into your backpack, past the water bottles and extra layers, and pulled out the trail mix. With a playful smile, you offered them a handful. Hidden amongst the nuts and dried fruit was a small, sparkling ring, a treasure that had been secretly accompanying you on your entire ascent.
ar: على قمة الجبل الذي تسلقتماه معًا في مغامرتكما الأولى. كان الخاتم مخبأً في كيس المكسرات طوال الوقت. عندما وجدته بين المكسرات والفواكه المجففة، كان كنزا يرمز لرحلتكما معًا.

# storyProposalHome
source: The soft glow of the lamp cast a warm and inviting light across your cozy living room, a space filled with the comfortable clutter of a life lived together. Photos on the mantelpiece chronicled your adventures, and a well-loved blanket was draped over the arm of the sofa where you had spent countless evenings. There were no grand gestures, no dramatic backdrops, just the quiet intimacy of the home you had built together. Surrounded by all the memories you had created, the laughter that had echoed through the rooms, and the love that had filled every corner, you knew that the most profound and meaningful moments often happen in the most familiar of places. It was in that simple, perfect setting that you asked them to share the rest of their lives with you.
ar: في غرفة معيشتكما المريحة، محاطين بكل الذكريات التي بنيتماها معًا. أحيانًا، تحدث أكثر اللحظات حميمية في أكثر الأماكن ألفة، وفي هذا المكان البسيط والمثالي، طلبت منها مشاركتك بقية حياتها.

# storyProposalRestaurant
source: The soft clinking of silverware and the low hum of conversation filled the air at the charming little restaurant where you had your very first date. It was a place steeped in nostalgia, a place where your love story had first begun to blossom. You had conspired with the waiter, a mischievous twinkle in his eye as he played his part in your romantic scheme. As the meal came to an end, he approached your table not with the dessert menu, but with a silver platter. Resting on a bed of rose petals was a small, elegant box. Just like in the movies, a perfect and timeless romantic gesture, you opened the box to reveal the ring, asking them to be your co-star in a love story for the ages.
ar: في نفس المطعم الذي كان فيه موعدكما الأول. أقنعت النادل بإحضار الخاتم مع الحلوى، تمامًا كما في الأفلام، لفتة رومانسية كلاسيكية في مكان يملؤه الحنين إلى بداية قصة حبكما.

# storyProposalBeach
source: The rhythmic sound of the waves crashing against the shore was a familiar and comforting melody on the beach where you had first uttered the words 'I love you.' The sun was beginning to set, casting a warm, golden glow across the sand. Earlier in the day, you had come to this very spot and carefully written your proposal in the wet sand, a secret message hidden just below the surface. As the tide began to recede, the water slowly revealed your heartfelt words, the question appearing as if by magic. As they read the words etched in the sand, you were already down on one knee, the sound of the ocean a witness to your love.
ar: على الشاطئ الذي قلتما فيه 'أحبك' لأول مرة. كتبت عرض الزواج على الرمال وانتظرت المد ليكشف عن رسالتك السرية. بينما كانت تقرأ الكلمات، كنت جاثيًا على ركبتيك، والبحر شاهد على حبكما.

# storyProposalGarden
source: The air in the botanical garden was sweet with the fragrance of cherry blossoms, the delicate pink and white petals creating a breathtaking canopy overhead. It was the peak of the season, a fleeting and beautiful moment that you wanted to capture forever. As you walked hand in hand through the serene and picturesque garden, a gentle breeze rustled the branches, causing the petals to fall like confetti, a natural celebration of the moment that was about to unfold. Surrounded by the ethereal beauty of the cherry blossoms, you stopped, turned to them, and asked the most important question of your life, the falling petals a soft and romantic blessing on your love.
ar: في الحديقة النباتية خلال موسم تفتح أزهار الكرز. تساقطت البتلات مثل قصاصات الورق الملونة بينما كنت تطرح أهم سؤال في حياتك، محاطًا بالجمال الأثيري للطبيعة.

# storyProposalRooftop
source: The city sprawled below you, a glittering tapestry of lights under a vast, star-dusted sky. From your vantage point on the secluded rooftop, the hustle and bustle of the world below seemed a distant murmur. It was a space that felt like your own private universe. For weeks, you had been studying star charts, and tonight, you pointed out constellations, tracing their shapes with your finger. But you had a secret map to share. You had carefully chosen a moment when a specific alignment of stars, with a little help from your imagination, seemed to spell out the words 'Marry Me.' As you revealed your celestial message, you brought out a ring that sparkled as brightly as the stars above.
ar: على سطح مبنى تحت النجوم، والمدينة تمتد في الأسفل. كنت قد خططت لشكل الأبراج بحيث تبدو وكأنها تكتب 'تزوجيني'. عندما كشفت عن رسالتك السماوية، أخرجت خاتمًا يلمع مثل النجوم.

# storyProposalPicnic
source: You led them to your secret meadow, a secluded spot you had discovered together, filled with wildflowers and bathed in the warm afternoon sun. A beautiful picnic was already laid out on a checkered blanket, a surprise to delight them. You feasted on their favorite foods and shared a bottle of champagne, reminiscing about your time together. At the very bottom of the picnic basket, nestled beneath the last of the treats, was a small, carefully wrapped package. It was your first photo together, a candid snapshot from the early days of your relationship. Taped to the back of the photo was a beautiful, delicate ring.
ar: خلال نزهة مفاجئة في مرجكما السري. كان الخاتم مخبأً في قاع سلة النزهة، ملفوفًا في أول صورة لكما معًا، كنز صغير في نهاية وجبة لذيذة.

# storyProposalWalk
source: The evening was calm and peaceful as you set out on your daily walk through the familiar streets of your neighborhood. It was a cherished routine, a time to decompress, to talk about your day, and to simply enjoy each other's company. The setting sun cast long shadows as you walked past familiar houses and waved to neighbors. There was nothing out of the ordinary about this particular walk, which was exactly the point. You wanted to show that your love wasn't just about the grand adventures and momentous occasions, but also about the quiet, everyday moments. As you paused under your favorite old oak tree, you realized that sometimes the most extraordinary and life-changing moments happen during the most ordinary and unassuming of activities.
ar: أثناء نزهتكما المسائية اليومية في الحي. أحيانًا تحدث أكثر اللحظات استثنائية خلال أكثر الأنشطة اعتيادية. تحت شجرة بلوط قديمة، أدركت أن الحب يكمن في اللحظات الهادئة والبسيطة.

# storyProposalStars
source: The crackling campfire cast a warm glow on your faces as you sat huddled together under a thick, cozy blanket. Far from the city lights, the sky above was a breathtaking blanket of stars, a celestial spectacle that made you feel both incredibly small and infinitely connected. You pointed out constellations, made wishes on satellites, and talked about the vastness of the universe. As a brilliant shooting star streaked across the inky black sky, you squeezed their hand and whispered that you had just made your wish. Then, you reached into your pocket and pulled out a ring, asking them to make your most heartfelt wish come true.
ar: تحت بطانية من النجوم خلال رحلة تخييم. انتظرت شهابًا ساقطًا لتتمنى أمنيتك بصوت عالٍ. ثم، أخرجت الخاتم وطلبت منها أن تحقق أمنيتك الأغلى.

# storyProposalRain
source: The sky opened up unexpectedly, a sudden downpour that mirrored the day you first met. Instead of seeking shelter, you embraced the rain, laughing as you got soaked to the skin. It felt symbolic, a cleansing and joyful moment. You told them that you wanted every significant moment of your lives to be blessed by what you playfully called 'heaven's tears of joy.' With raindrops plastering your hair to your face and your clothes clinging to you, you got down on one knee in a puddle, the rain washing over you both as you asked them to be your partner in weathering all of life's storms together.
ar: تحت المطر، تمامًا مثل لقائكما الأول. قلت إنك تريد أن تكون كل لحظة مهمة مباركة بـ 'دموع فرح السماء'. وبينما المطر يبللكما، ركعت على ركبة واحدة وطلبت منها مواجهة كل عواصف الحياة معًا.

# storyProposalCafe
source: The cozy aroma of coffee and pastries enveloped you as you sat at your usual table in the small café where you had spent countless lazy Sunday mornings. It was a place filled with the comfortable routine of your shared life. You had let the barista in on your secret, and as she brought over your lattes, she gave you a subtle, encouraging nod. At first, they didn't notice, but then they saw it, carefully written in the delicate foam of their latte: 'Will you marry me?' As they looked up from their cup, their eyes wide with surprise and delight, you were already holding out the ring.
ar: في المقهى الصغير الذي أمضيتما فيه صباحات أيام الأحد التي لا حصر لها. كان النادل مشاركًا في المفاجأة وكتب 'هل تتزوجينني؟' في رغوة اللاتيه. عندما رفعت عينيها عن فنجانها، كنت تحمل الخاتم بالفعل.

# storyProposalPark
source: You took them on a nostalgic journey, recreating your very first walk hand in hand through the park. You reminisced about your initial nervousness, the funny stories you told, and the exact moment your fingers first intertwined. You led them along the familiar path, past the duck pond and the old-fashioned bandstand, every step a retracing of your love story's beginning. You finally stopped at the very spot, under the shade of a large willow tree, where you had first known, with absolute certainty, that you were in love. It was there, in that place of profound personal significance, that you asked them to walk with you for the rest of your lives.
ar: في الحديقة التي مشيتما فيها يدًا بيد لأول مرة. أعدت تمثيل تلك النزهة بالضبط، لتنتهي عند النقطة التي عرفت فيها لأول مرة أنك واقع في الحب، وهناك طلبت منها أن تمشي معك لبقية حياتك.
